package com.dalvu.www.dalvyou.bean;

import java.util.List;

/**
 * 线路详情页里行程安排的bean类
 * Created by user on 2017/6/27.
 */

public class LinePlanDataBean {
    /**
     * status : 00000
     * msg : 成功
     * tour_description : [{"day":"22668","description":"天津集合，办理出境手续，搭乘飞机飞往有东方马尔代夫之称的越南【芽庄 】金兰湾国际机场。芽庄位于越南南部海岸线最东端，芽庄的海滨沙滩一望无际，幼滑的白沙，潮平水清，海底千姿百态的珊瑚，色彩斑斓成群追随在潜水者身旁的鱼类，就足够让海底探险者乐此不疲。芽庄是海滨旅游的理想胜地。早在越战时期，美军便将芽庄作为其度假胜地。团友们于当天抵达机场，（时差：比北京慢一小时）验证入关后，随即前往酒店入住。","hotel":"西西莉亚/八坂西贡","dining":"自理"},{"day":"22669","description":"享受没有morning cool早晨，中饭后乘车前往【龙山寺】芽庄市最大的寺院（60分钟），始建于1889年探访佛教文化的神秘与宁静，经过数次装修、重建，成为今天的外貌。寺内有金色巨龙雕花装饰、有莲花池、佛教壁画等。从正殿右边，上152个石阶后，就会看到高24米的一座巨大座佛。在这里可以眺望芽庄市内和周边全境。【芽庄大教堂】建于1928年法式建筑，整座教堂外型由石头雕刻而成又称石头大教堂。是这座城市必游景点之一，以独特的建筑风格吸引了无数游客；之后前往【芽庄沉香】（约60分钟）：芽庄沉香品质之高却享誉世界。它清新、幽雅，既有瓜果的甜香又有鲜花的芬芳。沉香可做药材使用，其功效具有提神醒脑、舒缓情绪、澄净心灵、理畅呼吸、辅助睡眠、调节内分泌等诸多养生保健功效；接着我们参观【婆那加占婆塔】（游览时间约20分钟），兴建于公元7-12世纪间，是印度教的建筑。占婆塔的建筑风格有些吴哥窟的味道，从塔往下看，能看到芽庄碧蓝的海港。中餐后前往法国电影《情人》的外景拍摄地【五指岩】（游览时间约20分钟），后返回酒店。行程特别赠送【泥浴中心】，富含氯化钠硅酸盐的矿物质泥浆采自100多米地下，涂满身体浸泡20分钟后，洗净再泡温泉水，对皮肤有排毒和修复的作用而闻名，让您充分舒缓疲劳；水疗、游泳池、休息区自由活动。【越南丝绸】或【珍珠店】，丝绸自古产中国，越南丝绸的起源，可以追溯到丝绸之路，当时郑和下西洋，通过海运的方式，把种桑养蚕，以及制作布匹一系列工艺带到越南。越南芽庄一年四季天气炎热，穿一些其它材质的不透气，而唯有丝绸，冬暖夏凉，舒适透气。奥黛是越南的国服，好比中国的国服中山装、旗袍。其实，最早越南的奥黛也是由中国的旗袍演变而来的。珍珠店，为亲朋好友带去一份小礼物，返回酒店。","hotel":"西西莉亚/八坂西贡","dining":"早,中"},{"day":"22670","description":"早餐后于酒店集合乘车前往出岛码头。开始有趣的联岛游，游船都是统一大小，下面是客仓，上门有平台，中间几排长椅，四周还能坐一圈人，各个小岛之间乘船大概几分钟不等；\n【第壹岛】（Mot Island）。又叫珊瑚岛，海水清澈透明，浮在水面埋下头，五彩斑斓的海底世界就清晰地和你融为一体，天气好的情况下，能见度能达到20米，珊瑚像丛林一般在水中摇摆，在这里可以潜水，一睹海底美妙的世界；\n【黑岛】黑岛保护区是芽庄浮潜看珊瑚的最佳地点；\n【妙岛-水族馆】（Hommieu）外面像一艘海盗船，特别精致，进去之后发现有很多的热带鱼，石斑鱼等等。\n","hotel":"西西莉亚/八坂西贡","dining":"早,中"},{"day":"22671","description":"酒店享用自助早餐（08:00-10:00），后自由活动。\n推荐自费：\n一、蚕岛精品游（含水果、泳池秀、高尔夫）参考价格380/人\n乘坐木船来到【蚕岛】，岛上享用自助大餐，岛上活动应有尽有，下午您可以欣赏到蚕岛五星酒店特有的歌舞表演(歌舞表演为酒店每日即时大众表演，专为团队客人表演），或者体验一把蚕岛高尔夫球场开放的免费20个球挥杆（如遇特殊情况高尔夫球场关闭，不再做另行安排）。或参加各种水上娱乐活动，享受水上独木舟免费一小时、海上皮划、簸箕船、。参观传统产品制作区，美艺，手工。还可尽情享受沙滩太阳浴，还可以于2400平米泳池尽情畅游。\n二、泥浆浴+越南特色晚餐  参考价格280/人\n芽庄的泥浆浴早已闻名遐迩，凡是到芽庄的游客，宁可不吃海鲜也要去THAPBA泡泥浴，该地富含有大量矿物质元素，尤其对清洁皮肤具有显着功效，一解您一路上的劳顿。\n三、珍珠乐园一日游+门票+导服+车费  参考价格400/人\n珍珠岛一日游,含车费+导游+门票+服务费，早餐后前往VIPEARLLAND专用码头搭乘【跨海览车约12分钟】前往越南最大的游乐园，珍珠岛渡假园区。【跨海缆车每柜可坐8人，全长3000多公尺，高54公尺，由缆车中俯看碧海、蓝天、海岸、山丘、船只点点，感受芽庄美丽的海景风光，并可抵御7级风】，后【越南珍珠岛】岛上一票通，岛上拥有一個【室外游乐园区】：有云霄飞车、海盗船、高山索道等各种精彩刺激的活动；还有一个【室內游戏区】：內设有4D电影、碰碰车等各式各样的大型电玩。一个【水上世界公园】：有多种水上游戏，如高空快速滑水道、懶人池、海浪池等；还有一个大型、堪比美/新加坡/圣淘沙的【海底世界】：在海底长廊里，各式各样的热带鱼、鲨鱼、海龟环绕其中，仿佛置身于海底（参考开放时间：周一至周四09：00-20：30，周五至周日09：00-21：00）。以上设施皆可免费使用和游览，另还有商店街及美食村等，后乘缆车或快艇返回岸上。\n","hotel":"西西莉亚/八坂西贡","dining":"中"},{"day":"22672","description":"今天早餐后于酒店前台办理退房手续后集合，乘车参观【婆那加占婆塔】（游览时间约20分钟），兴建于公元7-12世纪间，是印度教的建筑。占婆塔的建筑风格有些吴哥窟的味道，从塔往下看，能看到芽庄碧蓝的海港。中餐后前往法国电影《情人》的外景拍摄地【五指岩】（游览时间约20分钟），之后前往【芽庄乳胶】（约90分钟）：天然乳胶取材于橡胶树汁液，由蒸发模塑成型，因本身有无数的气孔，所以具有良好的透气性；因气孔的表面是平滑的，故螨虫等无法附着，同时乳胶弹性极佳，不易变形。之后前往机场返回温馨的家，结束愉悦的芽庄之旅。","hotel":"无","dining":"中"}]
     */

    public String status;
    public String msg;
    public List<TourDescriptionBean> tour_description;

    public static class TourDescriptionBean {
        /**
         * day : 22668
         * description : 天津集合，办理出境手续，搭乘飞机飞往有东方马尔代夫之称的越南【芽庄 】金兰湾国际机场。芽庄位于越南南部海岸线最东端，芽庄的海滨沙滩一望无际，幼滑的白沙，潮平水清，海底千姿百态的珊瑚，色彩斑斓成群追随在潜水者身旁的鱼类，就足够让海底探险者乐此不疲。芽庄是海滨旅游的理想胜地。早在越战时期，美军便将芽庄作为其度假胜地。团友们于当天抵达机场，（时差：比北京慢一小时）验证入关后，随即前往酒店入住。
         * hotel : 西西莉亚/八坂西贡
         * dining : 自理
         */

        public String day;
        public String description;
        public String hotel;
        public String dining;
    }
}
